<a href="https://colab.research.google.com/github/alberto-mabjaia/3dModelViewer/blob/main/SavechildrenOkokelhamo.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [13]:
import pandas as pd

df = pd.read_stata("MZHR81FL.DTA")
df.dropna(axis=1, how='all', inplace=True)

,hhid,hv000,hv001,hv002,hv003,hv004,hv005,hv006,hv007,hv008,...,hai13i_3,hai13i_4,hai13x_1,hai13x_2,hai13x_3,hai13x_4,hai13z_1,hai13z_2,hai13z_3,hai13z_4
0,1 5,MZ8,1,5,4,1,559281,7,2022,1471,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1 9,MZ8,1,9,1,1,559281,7,2022,1471,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1 14,MZ8,1,14,2,1,559281,7,2022,1471,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1 18,MZ8,1,18,1,1,559281,7,2022,1471,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1 22,MZ8,1,22,1,1,559281,7,2022,1471,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [16]:
df.rename(columns={'hv201': 'Water_points'}, inplace=True)
df['Water_points']

0                              piped to yard/plot
1                               piped to neighbor
2                            public tap/standpipe
3                            public tap/standpipe
4                            public tap/standpipe
                           ...
14245                        public tap/standpipe
14246    tube well or borehole (with manual bomb)
14247                        public tap/standpipe
14248                        public tap/standpipe
14249                        public tap/standpipe
Name: Water_points, Length: 14250, dtype: category
Categories (14, object): ['piped into dwelling' < 'piped to yard/plot' < 'piped to neighbor' <
                          'public tap/standpipe' ... 'rainwater' < 'tanker truck' < 'bottled water' < 'other']

In [19]:
df.rename(columns={'hv204': 'time_to_water_P'}, inplace=True)
df['time_to_water_P']

0        on premises
1        on premises
2                 30
3                 30
4         don't know
            ...
14245             30
14246             15
14247             30
14248             60
14249            120
Name: time_to_water_P, Length: 14250, dtype: category
Categories (106, object): [0 < 1 < 2 < 3 ... 780 < 900 < 'on premises' < 'don't know']

In [24]:
# type of sanitation facility
df.rename(columns={'hv205':'type-of-sanitation'}, inplace=True)
df['type-of-sanitation']

0        pit latrine without slab/open pit
1        pit latrine without slab/open pit
2        pit latrine without slab/open pit
3        pit latrine without slab/open pit
4        pit latrine without slab/open pit
                       ...
14245                pit latrine with slab
14246    pit latrine without slab/open pit
14247    pit latrine without slab/open pit
14248    pit latrine without slab/open pit
14249                pit latrine with slab
Name: type-of-sanitation, Length: 14250, dtype: category
Categories (13, object): ['flush to piped sewer system' < 'flush to septic tank' < 'flush to somewhere else' <
                          'flush, don't know where' ... 'no flush to septic tank' <
                          'no flush to somewhere else' < 'no flush, don't know where' < 'other']

In [27]:
#management of excreta
df.rename(columns={'hv257':'on-site-facilitations'}, inplace=True)
df['on-site-facilitations']

0                            NaN
1                            NaN
2                            NaN
3                            NaN
4        buried in a covered pit
                  ...
14245                        NaN
14246                        NaN
14247                        NaN
14248                        NaN
14249                        NaN
Name: on-site-facilitations, Length: 14250, dtype: category
Categories (6, object): ['treatment plant' < 'buried in a covered pit' <
                         'uncovered pit/bush/field/open ground' < 'surface water (river/dam/lake/pond/stream/can... <
                         'other' < 'don't know']

In [1]:
#variable to help understand level of Education regardin sanitation
df['hv237']

NameError: name 'df' is not defined